In [8]:
import pandas as pd

In [9]:
## series 1 d array like object that can holde any time of object

data=[1,2,3,4,5]
series = pd.Series(data)
print(series)
type(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

pandas.core.series.Series

In [10]:
#from dictionary
data= {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [11]:
data = [10,20,30]
index=['a','b','c']

pd.Series(data,index)

a    10
b    20
c    30
dtype: int64

In [34]:
## data frame is 2d similar to table
data = {
    'Name':['Krish','John','Jack'],
    'Age': [25,30,35],
    'City': ['Banglore','New York','Florida']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New York
2   Jack   35   Florida
<class 'pandas.core.frame.DataFrame'>

In [26]:
#Create a df from list of dictionary

data=[
    {'Name':'Krish', 'Age':32,'City':'Banglore'},
    {'Name':'John', 'Age':32,'City':'Banglore'},
    {'Name':'Krh', 'Age':32,'City':'Banglore'},
    {'Name':'ish', 'Age':32,'City':'Banglore'},
]
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      City
0  Krish   32  Banglore
1   John   32  Banglore
2    Krh   32  Banglore
3    ish   32  Banglore
<class 'pandas.core.frame.DataFrame'>

In [14]:
# import kagglehub

# path = kagglehub.dataset_download(
#     "shreyanshverma27/online-sales-dataset-popular-marketplace-data"
# )

# print("Path to dataset files:", path)
# import shutil

# dst = "/home/qss/Desktop/complete_data_science/data_analysis_with_python"
# shutil.move(path, dst)

In [98]:
data_path = 'data_analysis_with_python/1/Online Sales Data.csv'

df_csv = pd.read_csv("Online Sales Data.csv")

In [23]:
df.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [27]:
## accessing data from data frame

df

    Name  Age      City
0  Krish   32  Banglore
1   John   32  Banglore
2    Krh   32  Banglore
3    ish   32  Banglore

In [97]:
## data frame is 2d similar to table
data = {
    'Name':['Krish','John','Jack'],
    'Age': [25,30,35],
    'City': ['Banglore','New York','Florida']
}
index= [10,11,12]
df = pd.DataFrame(data,index)
print(df)
print(type(df))

     Name  Age      City
10  Krish   25  Banglore
11   John   30  New York
12   Jack   35   Florida
<class 'pandas.core.frame.DataFrame'>

In [61]:
"""
diff bw loc and iloc 
loc take the value from the index either created by or ir by default 
iloca take values from the index that starts from 0 - end
"""

'\ndiff bw loc and iloc \nloc take the value from the index either created by or ir by default \niloca take values from the index that starts from 0 - end\n'

In [43]:
df['Name']

10    Krish
11     John
12     Jack
Name: Name, dtype: object

In [50]:
# For row operation
df.loc[11]

Name        John
Age           30
City    New York
Name: 11, dtype: object

In [37]:
# For row operation
df.loc[0][0]

/tmp/ipykernel_17403/1463299793.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Krish'

In [59]:
#it is with index location
df.iloc[2]

Name       Jack
Age          35
City    Florida
Name: 12, dtype: object

In [47]:
df.iloc[0][0]

/tmp/ipykernel_17403/2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Krish'

In [63]:
# accessing the specified element
df

     Name  Age      City
10  Krish   25  Banglore
11   John   30  New York
12   Jack   35   Florida

In [65]:
df.at[11,'Age']

np.int64(30)

In [66]:
df.at[11,'Name']

'John'

In [68]:
# accessing through iat
df.iat[0,0]

'Krish'

In [79]:
## data manipulation with data frames
df

     Name  Age      City
10  Krish   25  Banglore
11   John   30  New York
12   Jack   35   Florida

In [ ]:
#adding the column
df['Salary']=[20000,60000,70000]
print(df)

     Name  Age      City  Salary
10  Krish   25  Banglore   20000
11   John   30  New York   60000
12   Jack   35   Florida   70000

In [89]:
#remove the column
# default axis value is 0 means rows but we want coumn so axis =1 
df.drop('Salary', axis =1, inplace=True)

In [90]:
df

     Name  Age      City
10  Krish   25  Banglore
11   John   30  New York
12   Jack   35   Florida

In [91]:
df['Age']=df['Age']+1
df

     Name  Age      City
10  Krish   26  Banglore
11   John   31  New York
12   Jack   36   Florida

In [93]:
df.drop(11)

     Name  Age      City
10  Krish   26  Banglore
12   Jack   36   Florida

In [99]:
df_csv.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [ ]:
df_csv